IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULOS.
DATA DIVISION.
    WORKING-STORAGE SECTION.
        77 X PIC 99.
        77 Y PIC 99.
        77 Z PIC 99.
        77 D PIC 99V99.
PROCEDURE DIVISION.
    SET X TO 25.
    SET Y TO 10.
    ADD X TO Y GIVING Z.
    DISPLAY "X + Y = "Z.
    
    SUBTRACT X FROM Y GIVING Z.
    DISPLAY "X - Y = "Z.
    
    MULTIPLY X BY Y GIVING Z.
    DISPLAY "X * Y = "Z.
    
    DIVIDE X BY Y GIVING D.
    DISPLAY "X / Y = "D.
STOP RUN.