IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULOS.
PROCEDURE DIVISION.
    DISPLAY "Olá Mundo!".
    DISPLAY "COBOL é uma linguagem PODEROSA!"
    
STOP RUN.