IDENTIFICATION DIVISION.
PROGRAM-ID. STRINGS-1.
DATA DIVISION.
    WORKING-STORAGE  SECTION.
    01 FRASE PIC X(250) VALUE SPACES.

PROCEDURE DIVISION.
    MOVE "COBOL-(COMMON.BUSINESS-ORIENTED.LANGUAGE)" TO FRASE

    DISPLAY FRASE
    DISPLAY "-----------------------------------------"

    INSPECT FRASE REPLACING
        ALL "-" BY " "
        ALL "." BY " "

    DISPLAY FRASE
STOP RUN.


